app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(title: params[:article], description: params[:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-07-09 20:59:01.336250"], ["id", 1]]